fantasy-rockstars-backend/app/controllers/band_members_controller.rb

SELECT "band_members".* FROM "band_members"
---
  def index
    band_members = BandMember.all.group_by(&:instrument)