fantasy-rockstars-backend/app/controllers/bands_controller.rb

SELECT "bands".* FROM "bands"
---
  def index
    bands = Band.all

SELECT "bands".* FROM "bands" WHERE "bands"."name" = $1 LIMIT $2  [["name", "Aaron's Band"], ["LIMIT", 1]]
---
  def show
    band = Band.find_by(name: params[:name])

INSERT INTO "bands" ("name", "guitarist_id", "bassist_id", "pianist_id", "drummer_id", "singer_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "woot"], ["guitarist_id", 3], ["bassist_id", 20], ["pianist_id", 44], ["drummer_id", 22], ["singer_id", 39]]
---
  def create
    band = Band.new(band_params)
    if band.save